#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.ragedunicorn_design: Refreshing state... [id=ragedunicorn-some-bucket-test]
aws_s3_bucket_versioning.ragedunicorn_design: Refreshing state... [id=ragedunicorn-some-bucket-test]
aws_s3_bucket_acl.ragedunicorn_design: Refreshing state... [id=ragedunicorn-some-bucket-test,private]
aws_s3_bucket_server_side_encryption_configuration.ragedunicorn_design: Refreshing state... [id=ragedunicorn-some-bucket-test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.ragedunicorn_design must be replaced
-/+ resource "aws_s3_bucket" "ragedunicorn_design" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::ragedunicorn-some-bucket-test" -> (known after apply)
      ~ bucket                      = "ragedunicorn-some-bucket-test" -> "ragedunicorn-some-bucket-test_module1" # forces replacement
      ~ bucket_domain_name          = "ragedunicorn-some-bucket-test.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "ragedunicorn-some-bucket-test.s3.eu-central-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z21DNDUVLTQW6Q" -> (known after apply)
      ~ id                          = "ragedunicorn-some-bucket-test" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "eu-central-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Description" = "Ragedunicorn S3 Design Bucket"
            "Name"        = "tf-ragedunicorn-design"
            "SomeNewTag"  = "Test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "3bb0b6153b27ef9b2120f58425799f6b7e008e4d2c33c85dcaa6ca4f2db06f43" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = false -> (known after apply)

              ~ apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  ~ sse_algorithm     = "AES256" -> (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_acl.ragedunicorn_design must be replaced
-/+ resource "aws_s3_bucket_acl" "ragedunicorn_design" {
      ~ bucket = "ragedunicorn-some-bucket-test" -> (known after apply) # forces replacement
      ~ id     = "ragedunicorn-some-bucket-test,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "3bb0b6153b27ef9b2120f58425799f6b7e008e4d2c33c85dcaa6ca4f2db06f43" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          ~ owner {
              + display_name = (known after apply)
              ~ id           = "3bb0b6153b27ef9b2120f58425799f6b7e008e4d2c33c85dcaa6ca4f2db06f43" -> (known after apply)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.ragedunicorn_design must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "ragedunicorn_design" {
      ~ bucket = "ragedunicorn-some-bucket-test" -> "ragedunicorn-some-bucket-test_module1" # forces replacement
      ~ id     = "ragedunicorn-some-bucket-test" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.ragedunicorn_design must be replaced
-/+ resource "aws_s3_bucket_versioning" "ragedunicorn_design" {
      ~ bucket = "ragedunicorn-some-bucket-test" -> (known after apply) # forces replacement
      ~ id     = "ragedunicorn-some-bucket-test" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ bucket_arn         = "arn:aws:s3:::ragedunicorn-some-bucket-test" -> (known after apply)
  ~ bucket_domain_name = "ragedunicorn-some-bucket-test.s3.amazonaws.com" -> (known after apply)
  ~ bucket_id          = "ragedunicorn-some-bucket-test" -> (known after apply)
  ~ region             = "eu-central-1" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @RagedUnicorn, Action: `pull_request`*